InformationRegisters/ЗначенияПоказателейСреднегоЗаработкаСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияПоказателейСреднегоЗаработкаСотрудников</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДневноеЗначение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЗначениеПоказателяРасчетаЗарплаты</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧасовоеЗначение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЗначениеПоказателяРасчетаЗарплаты</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействуетДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Показатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоказателиРасчетаЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеНачисленияУдержания</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЗначениеПоказателяРасчетаЗарплаты</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействуетДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Показатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоказателиРасчетаЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеНачисленияУдержания</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗначенияПоказателейСреднегоЗаработкаСотрудников/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(ФизическоеЛицо)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ЗаполнитьИнтервальныйРегистр");
	Методы.Вставить("ЗаполнитьЗначенияПоказателейСреднегоЗаработкаСотрудников");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляРегистраПодчиненногоРегистратору(Настройки);
КонецПроцедуры

#КонецОбласти

// Процедура заполняет интервальный регистр сведений ЗначенияПоказателейСреднегоЗаработкаСотрудниковИнтервальный.
//
Процедура ЗаполнитьИнтервальныйРегистр(ПараметрыОбновления = Неопределено) Экспорт
	
	ЗарплатаКадрыПериодическиеРегистры.ПеренестиВозвратныйРегистрВИнтервальныйРегистрСведений(
		Метаданные.РегистрыСведений.ЗначенияПоказателейСреднегоЗаработкаСотрудников.Имя, ПараметрыОбновления);
	
КонецПроцедуры

Процедура ОбновитьДвиженияИнтервальногоРегистра(МенеджерВременныхТаблиц) Экспорт
	
	ЗарплатаКадрыПериодическиеРегистры.ОбновитьДвиженияИнтервальногоРегистра(
		Метаданные.РегистрыСведений.ЗначенияПоказателейСреднегоЗаработкаСотрудников.Имя, МенеджерВременныхТаблиц);
	
КонецПроцедуры

Функция ОписаниеИнтервальногоРегистра() Экспорт
	
	ОписаниеИнтервальногоРегистра = ЗарплатаКадрыПериодическиеРегистры.ОписаниеИнтервальногоРегистра();
	
	ОписаниеИнтервальногоРегистра.ПараметрыНаследованияРесурсов = ПараметрыНаследованияРесурсов();
	ОписаниеИнтервальногоРегистра.ОсновноеИзмерение = "ФизическоеЛицо";
	ОписаниеИнтервальногоРегистра.ИзмеренияРасчета = "ФизическоеЛицо, Сотрудник, Организация, Показатель, ДокументОснование";
	
	Возврат ОписаниеИнтервальногоРегистра;
	
КонецФункции

Функция ПараметрыНаследованияРесурсов() Экспорт
	Возврат ЗарплатаКадрыПериодическиеРегистры.ПараметрыНаследованияРесурсов(Метаданные.РегистрыСведений.ЗначенияПоказателейСреднегоЗаработкаСотрудников.Имя);
КонецФункции

Процедура ПодготовитьОбновлениеЗависимыхДанныхПриОбменеПередЗаписью(Объект, Замещение) Экспорт
	
	ЗарплатаКадрыПериодическиеРегистры.КонтрольИзмененийПередЗаписью(Объект, Замещение);
	
КонецПроцедуры

Процедура ПодготовитьОбновлениеЗависимыхДанныхПриОбменеПриЗаписи(Объект, Замещение) Экспорт
	
	ЗарплатаКадрыПериодическиеРегистры.КонтрольИзмененийПриЗаписи(Объект, Замещение);
	
КонецПроцедуры

Процедура ЗаполнитьЗначенияПоказателейСреднегоЗаработкаСотрудников(ПараметрыОбновления = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Показатели", УчетСреднегоЗаработкаКлиентСервер.ПоказателиОбщегоСреднегоЗаработка());
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Командировка.Ссылка КАК Регистратор
		|ПОМЕСТИТЬ ВТРегистраторыПоказателей
		|ИЗ
		|	Документ.Командировка КАК Командировка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников КАК ЗначенияПериодическихПоказателей
		|		ПО Командировка.Ссылка = ЗначенияПериодическихПоказателей.Регистратор
		|			И (ЗначенияПериодическихПоказателей.Показатель В (&Показатели))
		|			И (Командировка.РассчитыватьСПлановымиНачислениями
		|				ИЛИ Командировка.ДлительнаяКомандировка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПоказателейСреднегоЗаработкаСотрудников КАК ЗначенияПоказателейСреднегоЗаработка
		|		ПО Командировка.Ссылка = ЗначенияПоказателейСреднегоЗаработка.Регистратор
		|ГДЕ
		|	ЗначенияПоказателейСреднегоЗаработка.Регистратор ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПереводНаОплатуПоСреднемуЗаработку.Ссылка
		|ИЗ
		|	Документ.ПереводНаОплатуПоСреднемуЗаработку КАК ПереводНаОплатуПоСреднемуЗаработку
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников КАК ЗначенияПериодическихПоказателей
		|		ПО ПереводНаОплатуПоСреднемуЗаработку.Ссылка = ЗначенияПериодическихПоказателей.Регистратор
		|			И (ЗначенияПериодическихПоказателей.Показатель В (&Показатели))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПоказателейСреднегоЗаработкаСотрудников КАК ЗначенияПоказателейСреднегоЗаработка
		|		ПО ПереводНаОплатуПоСреднемуЗаработку.Ссылка = ЗначенияПоказателейСреднегоЗаработка.Регистратор
		|ГДЕ
		|	ЗначенияПоказателейСреднегоЗаработка.Регистратор ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1000
		|	РегистраторыПоказателей.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ ВТВыбранныеДокументы
		|ИЗ
		|	ВТРегистраторыПоказателей КАК РегистраторыПоказателей
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыбранныеДокументы.Регистратор КАК Регистратор
		|ИЗ
		|	ВТВыбранныеДокументы КАК ВыбранныеДокументы";
	
	Если ПараметрыОбновления = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1000", "");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КомандировкаСреднийЗаработокОбщий.Ссылка КАК Ссылка,
		|	КомандировкаСреднийЗаработокОбщий.НомерСтроки КАК НомерСтроки,
		|	КомандировкаСреднийЗаработокОбщий.Сотрудник КАК Сотрудник,
		|	КомандировкаСреднийЗаработокОбщий.ПорядокРасчета КАК ПорядокРасчета,
		|	КомандировкаСреднийЗаработокОбщий.СоставнаяЧасть КАК СоставнаяЧасть,
		|	КомандировкаСреднийЗаработокОбщий.СтатьяФинансирования КАК СтатьяФинансирования,
		|	КомандировкаСреднийЗаработокОбщий.СпособОтраженияЗарплатыВБухучете КАК СпособОтраженияЗарплатыВБухучете,
		|	КомандировкаСреднийЗаработокОбщий.СтатьяРасходов КАК СтатьяРасходов,
		|	КомандировкаСреднийЗаработокОбщий.ОблагаетсяЕНВД КАК ОблагаетсяЕНВД,
		|	КомандировкаСреднийЗаработокОбщий.Период КАК Период,
		|	КомандировкаСреднийЗаработокОбщий.Индексируется КАК Индексируется,
		|	КомандировкаСреднийЗаработокОбщий.Сумма КАК Сумма,
		|	КомандировкаСреднийЗаработокОбщий.Год КАК Год,
		|	КомандировкаСреднийЗаработокОбщий.ДатаНачалаБазовогоПериода КАК ДатаНачалаБазовогоПериода,
		|	КомандировкаСреднийЗаработокОбщий.КоличествоМесяцев КАК КоличествоМесяцев,
		|	КомандировкаСреднийЗаработокОбщий.Источник КАК Источник,
		|	КомандировкаСреднийЗаработокОбщий.ИсключеннаяЧасть КАК ИсключеннаяЧасть,
		|	КомандировкаСреднийЗаработокОбщий.Начисление КАК Начисление
		|ПОМЕСТИТЬ ВТСреднийЗаработок
		|ИЗ
		|	Документ.Командировка.СреднийЗаработокОбщий КАК КомандировкаСреднийЗаработокОбщий
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВыбранныеДокументы КАК ВыбранныеДокументы
		|		ПО КомандировкаСреднийЗаработокОбщий.Ссылка = ВыбранныеДокументы.Регистратор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПереводСреднийЗаработокОбщий.Ссылка,
		|	ПереводСреднийЗаработокОбщий.НомерСтроки,
		|	ПереводСреднийЗаработокОбщий.Сотрудник,
		|	ПереводСреднийЗаработокОбщий.ПорядокРасчета,
		|	ПереводСреднийЗаработокОбщий.СоставнаяЧасть,
		|	ПереводСреднийЗаработокОбщий.СтатьяФинансирования,
		|	ПереводСреднийЗаработокОбщий.СпособОтраженияЗарплатыВБухучете,
		|	ПереводСреднийЗаработокОбщий.СтатьяРасходов,
		|	ПереводСреднийЗаработокОбщий.ОблагаетсяЕНВД,
		|	ПереводСреднийЗаработокОбщий.Период,
		|	ПереводСреднийЗаработокОбщий.Индексируется,
		|	ПереводСреднийЗаработокОбщий.Сумма,
		|	ПереводСреднийЗаработокОбщий.Год,
		|	ПереводСреднийЗаработокОбщий.ДатаНачалаБазовогоПериода,
		|	ПереводСреднийЗаработокОбщий.КоличествоМесяцев,
		|	ПереводСреднийЗаработокОбщий.Источник,
		|	ПереводСреднийЗаработокОбщий.ИсключеннаяЧасть,
		|	ПереводСреднийЗаработокОбщий.Начисление
		|ИЗ
		|	Документ.ПереводНаОплатуПоСреднемуЗаработку.СреднийЗаработокОбщий КАК ПереводСреднийЗаработокОбщий
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВыбранныеДокументы КАК ВыбранныеДокументы
		|		ПО ПереводСреднийЗаработокОбщий.Ссылка = ВыбранныеДокументы.Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КомандировкаДанныеОбИндексации.Ссылка КАК Ссылка,
		|	КомандировкаДанныеОбИндексации.НомерСтроки КАК НомерСтроки,
		|	КомандировкаДанныеОбИндексации.Сотрудник КАК Сотрудник,
		|	КомандировкаДанныеОбИндексации.Период КАК Период,
		|	КомандировкаДанныеОбИндексации.КоэффициентИндексации КАК КоэффициентИндексации
		|ПОМЕСТИТЬ ВТДанныеОбИндексации
		|ИЗ
		|	Документ.Командировка.ДанныеОбИндексации КАК КомандировкаДанныеОбИндексации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВыбранныеДокументы КАК ВыбранныеДокументы
		|		ПО КомандировкаДанныеОбИндексации.Ссылка = ВыбранныеДокументы.Регистратор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПереводДанныеОбИндексации.Ссылка,
		|	ПереводДанныеОбИндексации.НомерСтроки,
		|	ПереводДанныеОбИндексации.Сотрудник,
		|	ПереводДанныеОбИндексации.Период,
		|	ПереводДанныеОбИндексации.КоэффициентИндексации
		|ИЗ
		|	Документ.ПереводНаОплатуПоСреднемуЗаработку.ДанныеОбИндексации КАК ПереводДанныеОбИндексации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВыбранныеДокументы КАК ВыбранныеДокументы
		|		ПО ПереводДанныеОбИндексации.Ссылка = ВыбранныеДокументы.Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КомандировкаОтработанноеВремяДляСреднегоОбщий.Ссылка КАК Ссылка,
		|	КомандировкаОтработанноеВремяДляСреднегоОбщий.НомерСтроки КАК НомерСтроки,
		|	КомандировкаОтработанноеВремяДляСреднегоОбщий.Сотрудник КАК Сотрудник,
		|	КомандировкаОтработанноеВремяДляСреднегоОбщий.ПорядокРасчета КАК ПорядокРасчета,
		|	КомандировкаОтработанноеВремяДляСреднегоОбщий.Период КАК Период,
		|	КомандировкаОтработанноеВремяДляСреднегоОбщий.ОтработаноДней КАК ОтработаноДней,
		|	КомандировкаОтработанноеВремяДляСреднегоОбщий.ОтработаноДнейПятидневка КАК ОтработаноДнейПятидневка,
		|	КомандировкаОтработанноеВремяДляСреднегоОбщий.ОтработаноЧасов КАК ОтработаноЧасов,
		|	КомандировкаОтработанноеВремяДляСреднегоОбщий.ОтработаноДнейШестидневка КАК ОтработаноДнейШестидневка,
		|	КомандировкаОтработанноеВремяДляСреднегоОбщий.ОтработаноДнейКалендарных КАК ОтработаноДнейКалендарных,
		|	КомандировкаОтработанноеВремяДляСреднегоОбщий.НормаДнейПроизводственныйКалендарь КАК НормаДнейПроизводственныйКалендарь,
		|	КомандировкаОтработанноеВремяДляСреднегоОбщий.ОтработаноЧасовПятидневка КАК ОтработаноЧасовПятидневка,
		|	КомандировкаОтработанноеВремяДляСреднегоОбщий.НормаЧасовПроизводственныйКалендарь КАК НормаЧасовПроизводственныйКалендарь,
		|	КомандировкаОтработанноеВремяДляСреднегоОбщий.Источник КАК Источник
		|ПОМЕСТИТЬ ВТОтработанноеВремя
		|ИЗ
		|	Документ.Командировка.ОтработанноеВремяДляСреднегоОбщий КАК КомандировкаОтработанноеВремяДляСреднегоОбщий
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВыбранныеДокументы КАК ВыбранныеДокументы
		|		ПО КомандировкаОтработанноеВремяДляСреднегоОбщий.Ссылка = ВыбранныеДокументы.Регистратор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПереводОтработанноеВремяДляСреднегоОбщий.Ссылка,
		|	ПереводОтработанноеВремяДляСреднегоОбщий.НомерСтроки,
		|	ПереводОтработанноеВремяДляСреднегоОбщий.Сотрудник,
		|	ПереводОтработанноеВремяДляСреднегоОбщий.ПорядокРасчета,
		|	ПереводОтработанноеВремяДляСреднегоОбщий.Период,
		|	ПереводОтработанноеВремяДляСреднегоОбщий.ОтработаноДней,
		|	ПереводОтработанноеВремяДляСреднегоОбщий.ОтработаноДнейПятидневка,
		|	ПереводОтработанноеВремяДляСреднегоОбщий.ОтработаноЧасов,
		|	ПереводОтработанноеВремяДляСреднегоОбщий.ОтработаноДнейШестидневка,
		|	ПереводОтработанноеВремяДляСреднегоОбщий.ОтработаноДнейКалендарных,
		|	ПереводОтработанноеВремяДляСреднегоОбщий.НормаДнейПроизводственныйКалендарь,
		|	ПереводОтработанноеВремяДляСреднегоОбщий.ОтработаноЧасовПятидневка,
		|	ПереводОтработанноеВремяДляСреднегоОбщий.НормаЧасовПроизводственныйКалендарь,
		|	ПереводОтработанноеВремяДляСреднегоОбщий.Источник
		|ИЗ
		|	Документ.ПереводНаОплатуПоСреднемуЗаработку.ОтработанноеВремяДляСреднегоОбщий КАК ПереводОтработанноеВремяДляСреднегоОбщий
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВыбранныеДокументы КАК ВыбранныеДокументы
		|		ПО ПереводОтработанноеВремяДляСреднегоОбщий.Ссылка = ВыбранныеДокументы.Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Командировка.Ссылка КАК Регистратор,
		|	Командировка.Организация КАК Организация,
		|	Командировка.Сотрудник КАК Сотрудник,
		|	Командировка.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Командировка.ДатаНачалаСобытия КАК ДатаНачалаСобытия,
		|	Командировка.ДатаНачала КАК ДатаНачала,
		|	Командировка.ДатаОкончания КАК ДатаОкончания,
		|	Командировка.ПериодРасчетаСреднегоЗаработкаНачало КАК ПериодРасчетаСреднегоЗаработкаНачало,
		|	Командировка.ПериодРасчетаСреднегоЗаработкаОкончание КАК ПериодРасчетаСреднегоЗаработкаОкончание,
		|	Командировка.РассчитыватьСПлановымиНачислениями КАК РассчитыватьСПлановымиНачислениями
		|ИЗ
		|	Документ.Командировка КАК Командировка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВыбранныеДокументы КАК ВыбранныеДокументы
		|		ПО Командировка.Ссылка = ВыбранныеДокументы.Регистратор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПереводНаОплатуПоСреднемуЗаработку.Ссылка,
		|	ПереводНаОплатуПоСреднемуЗаработку.Организация,
		|	ПереводНаОплатуПоСреднемуЗаработку.Сотрудник,
		|	ПереводНаОплатуПоСреднемуЗаработку.ФизическоеЛицо,
		|	ПереводНаОплатуПоСреднемуЗаработку.ДатаНачалаСобытия,
		|	ПереводНаОплатуПоСреднемуЗаработку.ДатаНачала,
		|	ПереводНаОплатуПоСреднемуЗаработку.ДатаОкончания,
		|	ПереводНаОплатуПоСреднемуЗаработку.ПериодРасчетаСреднегоЗаработкаНачало,
		|	ПереводНаОплатуПоСреднемуЗаработку.ПериодРасчетаСреднегоЗаработкаОкончание,
		|	ИСТИНА
		|ИЗ
		|	Документ.ПереводНаОплатуПоСреднемуЗаработку КАК ПереводНаОплатуПоСреднемуЗаработку
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВыбранныеДокументы КАК ВыбранныеДокументы
		|		ПО ПереводНаОплатуПоСреднемуЗаработку.Ссылка = ВыбранныеДокументы.Регистратор";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "РегистрСведений.ЗначенияПоказателейСреднегоЗаработкаСотрудников.НаборЗаписей", "Регистратор", Выборка.Регистратор) Тогда
			Продолжить;
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Регистратор", Выборка.Регистратор);
		
		Запрос.Текст =
			"ВЫБРАТЬ
			|	СреднийЗаработок.*
			|ИЗ
			|	ВТСреднийЗаработок КАК СреднийЗаработок
			|ГДЕ
			|	СреднийЗаработок.Ссылка = &Регистратор
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДанныеОбИндексации.*
			|ИЗ
			|	ВТДанныеОбИндексации КАК ДанныеОбИндексации
			|ГДЕ
			|	ДанныеОбИндексации.Ссылка = &Регистратор
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ОтработанноеВремя.*
			|ИЗ
			|	ВТОтработанноеВремя КАК ОтработанноеВремя
			|ГДЕ
			|	ОтработанноеВремя.Ссылка = &Регистратор";
		
		РезультатыЗапроса = Запрос.ВыполнитьПакет();
		
		СреднийЗаработок = РезультатыЗапроса[0].Выгрузить();
		ДанныеОбИндексации = РезультатыЗапроса[1].Выгрузить();
		ОтработанноеВремя = РезультатыЗапроса[2].Выгрузить();
		
		ДополнительныеПараметры = УчетСреднегоЗаработкаКлиентСервер.ДополнительныеПараметрыРасчетаСреднегоЗаработка();
		ДополнительныеПараметры.Индексации = ДанныеОбИндексации;
		ДополнительныеПараметры.ДатаНачалаСобытия = Выборка.ДатаНачалаСобытия;
		ДополнительныеПараметры.НачалоПериода = Выборка.ПериодРасчетаСреднегоЗаработкаНачало;
		ДополнительныеПараметры.ОкончаниеПериода = Выборка.ПериодРасчетаСреднегоЗаработкаОкончание;
		
		ДополнительныеПараметры.ПоЧасам = Ложь;
		ЗначенияПоказателейСреднегоДневногоЗаработка = УчетСреднегоЗаработкаКлиентСервер.ЗначенияПоказателейСреднегоЗаработкаОбщего(СреднийЗаработок, ОтработанноеВремя, ДополнительныеПараметры);

		ДополнительныеПараметры.ПоЧасам = Истина;
		ЗначенияПоказателейСреднегоЧасовогоЗаработка = УчетСреднегоЗаработкаКлиентСервер.ЗначенияПоказателейСреднегоЗаработкаОбщего(СреднийЗаработок, ОтработанноеВремя, ДополнительныеПараметры);
		
		ДатаСобытия = ?(Выборка.РассчитыватьСПлановымиНачислениями, Выборка.ДатаНачала, КонецМесяца(Выборка.ДатаНачала) + 1);
		
		НаборЗаписей = РегистрыСведений.ЗначенияПоказателейСреднегоЗаработкаСотрудников.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
		
		Для Каждого КлючИЗначение Из ЗначенияПоказателейСреднегоДневногоЗаработка Цикл
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Период = ДатаСобытия;
			НоваяЗапись.Сотрудник = Выборка.Сотрудник;
			НоваяЗапись.Организация = Выборка.Организация;
			НоваяЗапись.ФизическоеЛицо = Выборка.ФизическоеЛицо;
			НоваяЗапись.Показатель = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты." + КлючИЗначение.Ключ);
			НоваяЗапись.ДокументОснование = Выборка.Регистратор;
			НоваяЗапись.ДневноеЗначение = КлючИЗначение.Значение;
			НоваяЗапись.ЧасовоеЗначение = ЗначенияПоказателейСреднегоЧасовогоЗаработка[КлючИЗначение.Ключ];
			НоваяЗапись.ДействуетДо = КонецДня(Выборка.ДатаОкончания) + 1;
		КонецЦикла;
		
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
